InformationRegisters/Варианты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Варианты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Число1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Варианты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере()
	Для Итератор = 1023 По 9876 Цикл
		Слово	= Формат(Итератор, "ЧГ=0");
		Напалм	= Новый Структура("Вариант,Число1,Число2,Число3,Число4", Лев(Слово, 1), Лев(Слово, 1));
		Для Буква = 2 По 4 Цикл
			Если СтрНайти(Напалм.Вариант, Сред(Слово, Буква, 1)) = 0 Тогда
				Напалм.Вариант	= Напалм.Вариант + Сред(Слово, Буква, 1);
				Напалм.Вставить("Число" + Формат(Буква, "ЧГ=0"), Сред(Слово, Буква, 1));
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрДлина(Напалм.Вариант) = 4 Тогда
			НЗ = РегистрыСведений.Варианты.СоздатьНаборЗаписей();
			НЗ.Отбор.Вариант.Установить(Напалм.Вариант);
			НЗ.Прочитать();
			Если НЗ.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Напалм);
				НЗ.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьНаСервере()
	НЗ = РегистрыСведений.Варианты.СоздатьНаборЗаписей();
	НЗ.Очистить();
	НЗ.Записать();
КонецПроцедуры
